app/controllers/coins_controller.rb

INSERT INTO "coins" ("name", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bitcoin"], ["value", 0], ["created_at", "2018-12-04 22:27:20.725946"], ["updated_at", "2018-12-04 22:27:20.725946"]]
---
  def create
  	coin = Coin.create(:name => params[:name], :value => params[:value].to_i)

SELECT  "coins".* FROM "coins" WHERE "coins"."name" = ? AND "coins"."value" = ? LIMIT ?  [["name", ""], ["value", 0], ["LIMIT", 1]]
---
  def update_one
    @coin = Coin.find_by(:name => params[:name], :value => params[:value].to_i)

SELECT  "coins".* FROM "coins" WHERE "coins"."name" = ? AND "coins"."value" = ? LIMIT ?  [["name", "michael"], ["value", 45], ["LIMIT", 1]]
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 1]]
---
  def delete_one
    @coin = Coin.find_by(:name => params[:name], :value => params[:value].to_i)

    @coin.delete

SELECT "coins".* FROM "coins"
---
  def see_all
    p params



  	@coins = Coin.all

SELECT  "coins".* FROM "coins" WHERE "coins"."name" = ? AND "coins"."value" = ? LIMIT ?  [["name", "michael"], ["value", 450], ["LIMIT", 1]]
---
  def see_one
    @coin = Coin.find_by(:name => params[:name], :value => params[:value].to_i)

SELECT "coins".* FROM "coins"
---
  def total_value
    @coins = Coin.all