app/controllers/coins_controller.rb

  def show
    @coin = Coin.find_by(:name => params[:name], :value => params[:value].to_i)
---
SELECT  "coins".* FROM "coins" WHERE "coins"."name" IS NULL AND "coins"."value" = ? LIMIT ?  [["value", 0], ["LIMIT", 1]]

  def update
    @coin = Coin.find_by(:name => params[:old_name], :value => params[:old_value].to_i)

    if @coin
      @coin.update(:name => params[:new_name], :value => params[:new_value].to_i)
---
SELECT  "coins".* FROM "coins" WHERE "coins"."name" IS NULL AND "coins"."value" = ? LIMIT ?  [["value", 0], ["LIMIT", 1]]
UPDATE "coins" SET "name" = ?, "value" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["name", nil], ["value", 0], ["updated_at", "2018-11-29 18:00:50.579377"], ["id", 1]]

  def delete
    @coin = Coin.find_by(:name => params[:name], :value => params[:value].to_i)

    if @coin
      @coin.delete
---
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 1]]