app/controllers/transactions_controller.rb

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (role = 'admin')
---
  def create
    @coin = Coin.find(params[:transaction][:coin_id])

    @transaction = Transaction.new(transaction_params)

    if @transaction.deposit == true
      if @coin.deposited? == false
        if @transaction.save
          @coin.update(deposited?: true)
          render json: { msg: "your coin has been deposited" }
        end
      else
        render json: { msg: "your coin is already deposited" }
      end
    else
      if @coin.deposited? == true
        if @transaction.save
          if @coin.quantity_deposited <= 4

            @admins = User.where("role = ?", "admin")