app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def see_all
  	@transactions = Transaction.all

SELECT "coins".* FROM "coins" WHERE "coins"."name" = ? AND "coins"."value" = ? AND "coins"."deposited?" = ?  [["name", "bitcoin"], ["value", 0], ["deposited?", "t"]]
UPDATE "coins" SET "deposited?" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["deposited?", "t"], ["updated_at", "2018-11-15 17:24:43.998161"], ["id", 1]]
INSERT INTO "transactions" ("coin_id", "user_id", "withdrawal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["coin_id", 1], ["user_id", 1], ["withdrawal", "t"], ["created_at", "2018-12-05 18:00:23.133162"], ["updated_at", "2018-12-05 18:00:23.133162"]]
---
  def create
  	@coin = Coin.find_by(:name => params[:name], :value => params[:value].to_i)

  	@coin.update(deposited?: true)

  	Transaction.create(coin_id: @coin.id, apiuser_id: "1")