app/controllers/users_controller.rb

  def current
    current_user.update!(last_login: Time.now)
---
UPDATE "users" SET "last_login" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_login", "2018-12-04 21:23:35.614230"], ["updated_at", "2018-12-04 21:23:35.620390"], ["id", 1]]

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def transactions
    @transactions = Transaction.where(user_id: current_user.id)
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]