app/views/transactions/index.html.erb

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "apiusers".* FROM "apiusers" WHERE "apiusers"."api_key" = ? LIMIT ?  [["api_key", "1234"], ["LIMIT", 1]]
---
time: <%= transaction.created_at %><br>
coin name: <%= Coin.find(transaction.coin_id).name %><br>
coin value: <%= Coin.find(transaction.coin_id).value %><br>
apiuser: <%= Apiuser.find(transaction.apiuser_id).api_key %><br><br>